prabhu-2.3.1/SOWFA-2.3.1/exampleCases/example.UAE_PhaseVI.ALMAdvanced/constant/airfoilProperties/Mod_S809_129
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.x                                 |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      airfoilProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
 
airfoilData
(
//   alpha   C_l       C_d
    (  -180.00   0.00000   0.17480)
    (  -170.00   0.23000   0.21160)
    (  -160.00   0.46000   0.31720)
    (  -150.00   0.49400   0.47840)
    (  -140.00   0.51000   0.67430)
    (  -130.00   0.48600   0.87990)
    (  -120.00   0.41500   1.06840)
    (  -110.00   0.30200   1.21480)
    (  -100.00   0.15900   1.29890)
    (   -90.00   0.00000   1.30800)
    (   -80.00  -0.15900   1.29890)
    (   -70.00  -0.30200   1.21480)
    (   -60.00  -0.41500   1.06840)
    (   -50.00  -0.48600   0.87990)
    (   -40.00  -0.51000   0.67430)
    (   -30.00  -0.49400   0.47840)
    (   -21.10  -0.56000   0.30270)
    (   -19.10  -0.67000   0.30690)
    (   -17.10  -0.79000   0.19280)
    (   -15.20  -0.84000   0.08980)
    (   -13.20  -0.70000   0.05530)
    (   -11.10  -0.63000   0.03900)
    (    -9.20  -0.56000   0.02330)
    (    -7.10  -0.64000   0.01310)
    (    -5.10  -0.42900   0.01340)
    (    -3.10  -0.20200   0.01190)
    (    -0.90   0.05900   0.01220)
    (     1.00   0.29400   0.01160)
    (     3.10   0.53900   0.01440)
    (     5.20   0.78900   0.01460)
    (     7.10   1.00000   0.01620)
    (     9.20   1.21500   0.02740)
    (    10.30   1.28800   0.03030)
    (    11.10   1.33900   0.03690)
    (    12.20   1.42100   0.05090)
    (    13.20   1.48500   0.06480)
    (    14.30   1.53900   0.07760)
    (    15.30   1.60400   0.09170)
    (    16.10   1.63900   0.09940)
    (    17.10   1.67600   0.23060)
    (    18.10   1.69100   0.40000)
    (    19.10   1.74800   0.40000)
    (    25.80   2.62200   0.47840)
    (    30.00   2.60637   0.61400)
    (    34.40   2.59000   0.75500)
    (    40.00   2.43300   1.57437)
    (    45.00   2.23600   2.37800)
    (    50.00   2.05600   2.40300)
    (    60.00   1.63500   2.45500)
    (    70.00   0.97100   2.47200)
    (    80.00   0.38500   2.47600)
    (    90.00   0.00000   2.46800)
    (   100.00  -0.15900   1.29890)
    (   110.00  -0.30200   1.21480)
    (   120.00  -0.41500   1.06840)
    (   130.00  -0.48600   0.87990)
    (   140.00  -0.51000   0.67430)
    (   150.00  -0.49400   0.47840)
    (   160.00  -0.46000   0.31720)
    (   170.00  -0.23000   0.21160)
    (   180.00   0.00000   0.17480)
);