prabhu-2.3.1/SOWFA-2.3.1/exampleCases/example.UAE_PhaseVI.ALMAdvanced/constant/airfoilProperties/Mod_S809_600
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.x                                 |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      airfoilProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
 
airfoilData
(
//   alpha   C_l       C_d
    (  -180.00   0.00000   0.17480)
    (  -170.00   0.23000   0.21160)
    (  -160.00   0.46000   0.31720)
    (  -150.00   0.49400   0.47840)
    (  -140.00   0.51000   0.67430)
    (  -130.00   0.48600   0.87990)
    (  -120.00   0.41500   1.06840)
    (  -110.00   0.30200   1.21480)
    (  -100.00   0.15900   1.29890)
    (   -90.00   0.00000   1.30800)
    (   -80.00  -0.15900   1.29890)
    (   -70.00  -0.30200   1.21480)
    (   -60.00  -0.41500   1.06840)
    (   -50.00  -0.48600   0.87990)
    (   -40.00  -0.51000   0.67430)
    (   -30.00  -0.49400   0.47840)
    (   -21.10  -0.56000   0.30270)
    (   -19.10  -0.67000   0.30690)
    (   -17.10  -0.79000   0.19280)
    (   -15.20  -0.84000   0.08980)
    (   -13.20  -0.70000   0.05530)
    (   -11.10  -0.63000   0.03900)
    (    -9.20  -0.56000   0.02330)
    (    -7.10  -0.64000   0.01310)
    (    -5.10  -0.42150   0.01340)
    (    -3.10  -0.20900   0.01190)
    (    -0.90   0.05150   0.01220)
    (     1.00   0.29900   0.01160)
    (     3.10   0.54000   0.01440)
    (     5.20   0.79000   0.01460)
    (     6.15   0.88650   0.01540)
    (     7.10   0.98300   0.01620)
    (     8.15   1.00000   0.02180)
    (     9.20   1.01700   0.02740)
    (    10.30   1.03900   0.03030)
    (    11.10   1.06400   0.03690)
    (    12.20   1.11200   0.05090)
    (    13.34   1.11600   0.06480)
    (    14.30   1.06900   0.07760)
    (    15.30   1.03400   0.09170)
    (    16.10   0.97400   0.09940)
    (    17.10   0.90000   0.18600)
    (    18.10   0.85000   0.29800)
    (    19.10   0.84100   0.35000)
    (    25.00   1.15500   0.45800)
    (    30.00   1.08200   0.55358)
    (    35.60   1.03400   0.67430)
    (    40.00   1.06400   0.84548)
    (    45.00   1.03900   1.04000)
    (    50.00   0.94000   1.12000)
    (    60.00   0.72500   1.22700)
    (    70.00   0.51050   1.29600)
    (    80.00   0.25000   1.33500)
    (    90.00   0.00000   1.33900)
    (   100.00  -0.15900   1.29890)
    (   110.00  -0.30200   1.21480)
    (   120.00  -0.41500   1.06840)
    (   130.00  -0.48600   0.87990)
    (   140.00  -0.51000   0.67430)
    (   150.00  -0.49400   0.47840)
    (   160.00  -0.46000   0.31720)
    (   170.00  -0.23000   0.21160)
    (   180.00   0.00000   0.17480)
);